       IDENTIFICATION DIVISION.
       PROGRAM-ID. OnlineProgram.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY COMMON_COPYBOOK2.
       PROCEDURE DIVISION.
       BEGIN.
           DISPLAY "Online program processing..."
       END PROGRAM OnlineProgram.
