       IDENTIFICATION DIVISION.
       PROGRAM-ID. BatchProgram.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY COMMON_COPYBOOK1.
       PROCEDURE DIVISION.
       BEGIN.
           DISPLAY "Batch program processing..."
       END PROGRAM BatchProgram.
